# LandingShapeHandleOnPinnedRunFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..LandingShapeHandleOnPinnedRunFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Cannot Drag the automatic landing shape handle control because the connected run is pinned.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LandingShapeHandleOnPinnedRunFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LandingShapeHandleOnPinnedRunFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LandingShapeHandleOnPinnedRunFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace